## Step1:Data collection from Kaggle
collected the multiple data from kaggle for analysis

1.https://www.kaggle.com/datasets/lakshmi25npathi/online-retail-dataset?select=online_retail_II.xlsx

2.https://www.kaggle.com/datasets/saadharoon27/superstore-dataset

3.https://www.kaggle.com/datasets/fatihilhan/global-superstore-dataset

## Step2:Importing the necessary library

In [85]:
import pandas as pd

## Step3:Data preprocessing

In [86]:
df1=pd.read_csv('SuperStore_Sales_Dataset.csv')
df1.head(2)

,Row ID+O6G3A1:R6,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Category,Sub-Category,Product Name,Sales,Quantity,Profit,Returns,Payment Mode,ind1,ind2
0,4918,CA-2019-160304,01-01-2019,07-01-2019,Standard Class,BM-11575,Brendan Murry,Corporate,United States,Gaithersburg,...,Furniture,Bookcases,"Bush Westfield Collection Bookcases, Medium Ch...",73.94,1,28.2668,NaN,Online,NaN,NaN
1,4919,CA-2019-160304,02-01-2019,07-01-2019,Standard Class,BM-11575,Brendan Murry,Corporate,United States,Gaithersburg,...,Furniture,Bookcases,"Bush Westfield Collection Bookcases, Medium Ch...",173.94,3,38.2668,NaN,Online,NaN,NaN

In [87]:
df2=pd.read_csv('superstore.csv')
df2.head(2)

,Category,City,Country,Customer.ID,Customer.Name,Discount,Market,记录数,Order.Date,Order.ID,...,Sales,Segment,Ship.Date,Ship.Mode,Shipping.Cost,State,Sub.Category,Year,Market2,weeknum
0,Office Supplies,Los Angeles,United States,LS-172304,Lycoris Saunders,0.0,US,1,2011-01-07 00:00:00.000,CA-2011-130813,...,19,Consumer,2011-01-09 00:00:00.000,Second Class,4.37,California,Paper,2011,North America,2
1,Office Supplies,Los Angeles,United States,MV-174854,Mark Van Huff,0.0,US,1,2011-01-21 00:00:00.000,CA-2011-148614,...,19,Consumer,2011-01-26 00:00:00.000,Standard Class,0.94,California,Paper,2011,North America,4

In [88]:
df3=pd.read_csv('online_retail_II.csv', encoding='ISO-8859-1')
df3.head(2)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,01-12-09 7:45,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,01-12-09 7:45,6.75,13085.0,United Kingdom

In [13]:
df1.columns

Index(['Row ID+O6G3A1:R6', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Region', 'Product ID', 'Category', 'Sub-Category', 'Product Name',
       'Sales', 'Quantity', 'Profit', 'Returns', 'Payment Mode', 'ind1',
       'ind2'],
      dtype='object')

In [14]:
df2.columns

Index(['Category', 'City', 'Country', 'Customer.ID', 'Customer.Name',
       'Discount', 'Market', '记录数', 'Order.Date', 'Order.ID', 'Order.Priority',
       'Product.ID', 'Product.Name', 'Profit', 'Quantity', 'Region', 'Row.ID',
       'Sales', 'Segment', 'Ship.Date', 'Ship.Mode', 'Shipping.Cost', 'State',
       'Sub.Category', 'Year', 'Market2', 'weeknum'],
      dtype='object')

In [15]:
df3.columns

Index(['Invoice', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'Price', 'Customer ID', 'Country'],
      dtype='object')

## Step 4: Data cleaning

In [ ]:
# drop the unecessary columns

In [89]:
df1.drop(columns=['Row ID+O6G3A1:R6','Ship Date', 'Ship Mode','Segment','City', 'State','Region', 'Product ID', 'Category', 'Sub-Category', 'Product Name',
       
                'Returns', 'Payment Mode', 'ind1',  'ind2', 'Customer Name','Order ID'],inplace=True)

In [90]:
df2.drop(columns=['Category', 'City', 'Discount', 'Market', '记录数','Order.Priority',
       'Product.ID', 'Product.Name','Region', 'Row.ID', 'Segment', 'Ship.Date', 'Ship.Mode', 'Shipping.Cost', 'State',
       'Sub.Category', 'Year', 'Market2', 'weeknum', 'Customer.Name', 'Order.ID'],inplace=True)

In [91]:
df3.drop(columns=['Invoice', 'StockCode', 'Description'],inplace=True)

In [92]:
df1.columns

Index(['Order Date', 'Customer ID', 'Country', 'Sales', 'Quantity', 'Profit'], dtype='object')

In [93]:
df2.columns

Index(['Country', 'Customer.ID', 'Order.Date', 'Profit', 'Quantity', 'Sales'], dtype='object')

In [94]:
df3.columns

Index(['Quantity', 'InvoiceDate', 'Price', 'Customer ID', 'Country'], dtype='object')

In [95]:
df1.rename(columns={'Sales':'UnitPrice', 'Order Date':'Order_Date', 'Customer ID':'Customer_ID', 'Profit':'TotalPrice'},inplace=True)

In [96]:
df1.columns

Index(['Order_Date', 'Customer_ID', 'Country', 'UnitPrice', 'Quantity',
       'TotalPrice'],
      dtype='object')

In [97]:
df2.rename(columns={'Sales':'UnitPrice', 'Order.Date':'Order_Date', 'Customer.ID':'Customer_ID', 'Profit':'TotalPrice'},inplace=True)

In [98]:
df2.columns

Index(['Country', 'Customer_ID', 'Order_Date', 'TotalPrice', 'Quantity',
       'UnitPrice'],
      dtype='object')

In [100]:
df3.rename(columns={'InvoiceDate':'Order_Date','Customer ID':'Customer_ID','Price':'UnitPrice'},inplace=True)

In [102]:
df3.columns

Index(['Quantity', 'Order_Date', 'UnitPrice', 'Customer_ID', 'Country'], dtype='object')

In [103]:
# adding the totalprice column to df3
df3['TotalPrice']=df3['Quantity']*df3['UnitPrice']

In [104]:
df1.shape

(5901, 6)

In [105]:
df2.shape

(51290, 6)

In [106]:
df3.shape

(525461, 6)

## Step 5 Handling missing values

In [107]:
df3.isna().sum()

Quantity            0
Order_Date          0
UnitPrice           0
Customer_ID    107927
Country             0
TotalPrice          0
dtype: int64

In [108]:
df2.isna().sum()

Country        0
Customer_ID    0
Order_Date     0
TotalPrice     0
Quantity       0
UnitPrice      0
dtype: int64

In [109]:
df1.isna().sum()

Order_Date     0
Customer_ID    0
Country        0
UnitPrice      0
Quantity       0
TotalPrice     0
dtype: int64

In [110]:
# dropping null values from df3
df3.dropna(inplace=True)

In [111]:
df3.isna().sum()

Quantity       0
Order_Date     0
UnitPrice      0
Customer_ID    0
Country        0
TotalPrice     0
dtype: int64

In [112]:
df3.shape

(417534, 6)

## Step 6 :storing equal amount of data from each dataframe for further analysis

In [113]:
df4=df1[:3000]

In [114]:
df5=df2[:3000]

In [115]:
df6=df3[:3000]

In [116]:
df4.shape,df5.shape,df6.shape

((3000, 6), (3000, 6), (3000, 6))

In [117]:
df6.head(4)

   Quantity     Order_Date  UnitPrice  Customer_ID         Country  TotalPrice
0        12  01-12-09 7:45       6.95      13085.0  United Kingdom        83.4
1        12  01-12-09 7:45       6.75      13085.0  United Kingdom        81.0
2        12  01-12-09 7:45       6.75      13085.0  United Kingdom        81.0
3        48  01-12-09 7:45       2.10      13085.0  United Kingdom       100.8

In [118]:
df4.head(4)

   Order_Date Customer_ID        Country  UnitPrice  Quantity  TotalPrice
0  01-01-2019    BM-11575  United States      73.94         1     28.2668
1  02-01-2019    BM-11575  United States     173.94         3     38.2668
2  02-01-2019    BM-11575  United States     231.98         2     67.2742
3  03-01-2019    LR-16915  United States     114.46         2     28.6150

In [119]:
df5.head(5)

,Country,Customer_ID,Order_Date,TotalPrice,Quantity,UnitPrice
0,United States,LS-172304,2011-01-07 00:00:00.000,9.3312,3,19
1,United States,MV-174854,2011-01-21 00:00:00.000,9.2928,2,19
2,United States,CS-121304,2011-08-05 00:00:00.000,9.8418,3,21
3,United States,CS-121304,2011-08-05 00:00:00.000,53.2608,2,111
4,United States,AP-109154,2011-09-29 00:00:00.000,3.1104,1,6

## Step 7 Merge all the dataframe for further analysis

In [120]:
retail=pd.concat([df4,df5,df6])

In [ ]:
# assigning unique order id

In [121]:
retail['Order_ID']= range(1, len(retail) + 1)

In [122]:
len(retail)

9000

In [123]:
retail

,Order_Date,Customer_ID,Country,UnitPrice,Quantity,TotalPrice,Order_ID
0,01-01-2019,BM-11575,United States,73.94,1,28.2668,1
1,02-01-2019,BM-11575,United States,173.94,3,38.2668,2
2,02-01-2019,BM-11575,United States,231.98,2,67.2742,3
3,03-01-2019,LR-16915,United States,114.46,2,28.6150,4
4,03-01-2019,CA-12310,United States,30.08,2,-5.2640,5
...,...,...,...,...,...,...,...
3912,02-12-09 11:55,13564.0,United Kingdom,3.95,2,7.9000,8996
3913,02-12-09 11:55,13564.0,United Kingdom,4.95,2,9.9000,8997
3914,02-12-09 11:55,13564.0,United Kingdom,5.95,2,11.9000,8998
3915,02-12-09 11:55,13564.0,United Kingdom,3.75,3,11.2500,8999
3916,02-12-09 11:55,13564.0,United Kingdom,1.49,4,5.9600,9000

In [124]:
retail.dtypes

Order_Date      object
Customer_ID     object
Country         object
UnitPrice      float64
Quantity         int64
TotalPrice     float64
Order_ID         int64
dtype: object

In [125]:
retail['Order_Date']

0           01-01-2019
1           02-01-2019
2           02-01-2019
3           03-01-2019
4           03-01-2019
             ...
3912    02-12-09 11:55
3913    02-12-09 11:55
3914    02-12-09 11:55
3915    02-12-09 11:55
3916    02-12-09 11:55
Name: Order_Date, Length: 9000, dtype: object

In [ ]:
# converting order_date datatype to date

In [126]:
retail['Order_Date'] = pd.to_datetime(retail['Order_Date'], dayfirst=True, format='mixed', errors='coerce')

In [127]:
# changing the format
retail['Order_Date'] = retail['Order_Date'].dt.strftime('%Y-%m-%d')

In [128]:
retail

,Order_Date,Customer_ID,Country,UnitPrice,Quantity,TotalPrice,Order_ID
0,2019-01-01,BM-11575,United States,73.94,1,28.2668,1
1,2019-01-02,BM-11575,United States,173.94,3,38.2668,2
2,2019-01-02,BM-11575,United States,231.98,2,67.2742,3
3,2019-01-03,LR-16915,United States,114.46,2,28.6150,4
4,2019-01-03,CA-12310,United States,30.08,2,-5.2640,5
...,...,...,...,...,...,...,...
3912,2009-12-02,13564.0,United Kingdom,3.95,2,7.9000,8996
3913,2009-12-02,13564.0,United Kingdom,4.95,2,9.9000,8997
3914,2009-12-02,13564.0,United Kingdom,5.95,2,11.9000,8998
3915,2009-12-02,13564.0,United Kingdom,3.75,3,11.2500,8999
3916,2009-12-02,13564.0,United Kingdom,1.49,4,5.9600,9000

In [129]:
retail.isna().sum()

Order_Date     0
Customer_ID    0
Country        0
UnitPrice      0
Quantity       0
TotalPrice     0
Order_ID       0
dtype: int64

In [130]:
retail.duplicated().sum()

0

## Step 8 Export cleaned data to a CSV

In [131]:
retail.to_csv('cleaned_build_week_data.csv',index=False)